app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "users" SET "reset_password_token" = ?, "updated_at" = ?, "admin" = ? WHERE "users"."id" = ?  [["reset_password_token", "[FILTERED]"], ["updated_at", "2023-03-24 12:47:59.131654"], ["admin", 1], ["id", 15]]
---
    def update
      @user = User.find(params[:id])
      if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 13]]
---
    def destroy
      @user = User.find(params[:id])
      @user.destroy