app/controllers/home_controller.rb

SELECT "users".* FROM "users"
---
  def admin
    @user_admin = User.all