app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    if user_signed_in?
      @projects = Project.all

INSERT INTO "projects" ("name", "discussion", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "p11111"], ["discussion", "1111111"], ["created_at", "2023-03-30 08:36:29.266250"], ["updated_at", "2023-03-30 08:36:29.266250"], ["user_id", 17]]
---
  def create

    if user_signed_in?
      # @project = Project.new(project_params)

      @project = current_user.projects.build(project_params)

      respond_to do |format|
        if @project.save

UPDATE "projects" SET "discussion" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["discussion", "ascc"], ["updated_at", "2023-03-30 08:02:32.207370"], ["id", 14]]
---
  def update
    if user_signed_in?
      respond_to do |format|
        if @project.update(project_params)

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 17], ["id", 14], ["LIMIT", 1]]
---
  def correct_user
    @project = current_user.projects.find_by(id: params[:id])